aaron-bond.better-comments
angular.ng-template
astro-build.astro-vscode
beardedbear.beardedtheme
beilunyang.cursor-rules
bradlc.vscode-tailwindcss
cardinal90.multi-cursor-case-preserve
catppuccin.catppuccin-vsc
chakrounanas.turbo-console-log
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
expo.vscode-expo-tools
fabiospampinato.vscode-search-open-all-results
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gruntfuggly.todo-tree
inferrinizzard.prettier-sql-vscode
infinity1207.angular2-switcher
irongeek.vscode-env
johnpapa.angular2
lakshits11.best-themes-redefined
mariusalchimavicius.json-to-ts
mattpocock.ts-error-translator
mechatroner.rainbow-csv
miguelsolorio.symbols
million.million-lint
ms-dotnettools.vscode-dotnet-runtime
nrwl.angular-console
pmneo.tsimporter
raillyhugo.one-hunter
rangav.vscode-thunder-client
redhat.vscode-yaml
ryu1kn.partial-diff
sidneys1.gitconfig
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-british-english
stripe.vscode-stripe
supabase.postgrestools
supabase.vscode-supabase-extension
swmansion.react-native-ide
tamasfe.even-better-toml
teabyii.ayu
timonwong.shellcheck
tomoki1207.pdf
tomwhite007.rename-angular-component
usernamehw.errorlens
vitaliymaz.vscode-svg-previewer
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
yoavbls.pretty-ts-errors
